const quotes = {
  statham: [
  "Многие считают, что лучшая пара,это когда парень выше девушки, но лучшая пара та-которую отменили.",
  "Если жизнь - это вызов, то я перезвоню.",
  "Я так много читал о вреде алкоголя, что решил бросить читать."
  ],
  ronaldo: [
    "Ваша любовь делает меня сильным, ваша ненависть делает меня неудержимым.",
    "Иногда для большого прыжка нужно сделать шаг назад.",
    "В жизни всё нелегко. Если бы было наоборот, мы не рождались бы плача.",

  ],
  David: [
    "Не останавливайся, когда устал. Остановись, когда закончишь",
    "Вы можете проиграть утреннюю битву, но не проиграть дневную войну!",
    "Если ты думаешь, что ты достиг вершины, помни, твой потолок чей-то пол. Именно таким ты хотел стать?",
    "Иногда нужно вступить в войну с самим собой, чтобы исправить себя.",
    "Суть в том,  что жизнь - это одна большая игра разума.  Единственный человек,  против которого вы играете,  - это вы сами"
  ],
   Jack: [
    "Сегодня будет непросто, завтра будет еще хуже, но послезавтра все будет прекрасно.",
    "Миру наплевать на то, что вы скажете, важно то, что вы сделаете.",
    "Ищите правильных людей, а не лучших людей.",
    "Забудьте о конкурентах и сфокусируйтесь на клиентах.",
    "Если вы относитесь ко всем вокруг как к врагам, то они и будут вашими врагами."
  ]
};

const backgrounds = {
  statham: "url('images/statham.jpg')",
  jobs: "url('images/ronaldo.jpg')",
  twain: "url('images/David.jpg')"
};

let currentAuthor = null;

const menuBtn = document.getElementById("menuBtn");
const menuList = document.getElementById("menuList");
const quoteText = document.getElementById("quoteText");

menuBtn.addEventListener("click", () => {
  menuList.style.display = menuList.style.display === "flex" ? "none" : "flex";
});

function selectAuthor(author) {
  currentAuthor = author;
  document.body.style.backgroundImage = backgrounds[author];
  nextQuote();
  menuList.style.display = "none";
}

function nextQuote() {
  if (!currentAuthor) {
    quoteText.textContent = "Сначала выберите автора 🙂";
    return;
  }
  const authorQuotes = quotes[currentAuthor];
  const randomIndex = Math.floor(Math.random() * authorQuotes.length);
  quoteText.textContent = authorQuotes[randomIndex];
}
